harishankarn04/MIMXRT1064_Project_LED/board/pin_mux.h
/* GPIO_EMC_34 (coord D4), SEMC_D12 */
/* Routed pin properties */
#define BOARD_INITSDRAM_SEMC_D12_PERIPHERAL                                 SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAM_SEMC_D12_SIGNAL                                     DATA   /*!< Signal name */
#define BOARD_INITSDRAM_SEMC_D12_CHANNEL                                     12U   /*!< Signal channel */

/* GPIO_EMC_35 (coord E5), SEMC_D13 */
/* Routed pin properties */
#define BOARD_INITSDRAM_SEMC_D13_PERIPHERAL                                 SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAM_SEMC_D13_SIGNAL                                     DATA   /*!< Signal name */
#define BOARD_INITSDRAM_SEMC_D13_CHANNEL                                     13U   /*!< Signal channel */

/* GPIO_EMC_36 (coord C3), SEMC_D14 */
/* Routed pin properties */
#define BOARD_INITSDRAM_SEMC_D14_PERIPHERAL                                 SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAM_SEMC_D14_SIGNAL                                     DATA   /*!< Signal name */
#define BOARD_INITSDRAM_SEMC_D14_CHANNEL                                     14U   /*!< Signal channel */

/* GPIO_EMC_37 (coord E4), SEMC_D15 */
/* Routed pin properties */
#define BOARD_INITSDRAM_SEMC_D15_PERIPHERAL                                 SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAM_SEMC_D15_SIGNAL                                     DATA   /*!< Signal name */
#define BOARD_INITSDRAM_SEMC_D15_CHANNEL                                     15U   /*!< Signal channel */

/* GPIO_EMC_08 (coord H3), SEMC_DM0 */
/* Routed pin properties */
#define BOARD_INITSDRAM_SEMC_DM0_PERIPHERAL                                 SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAM_SEMC_DM0_SIGNAL                                       DM   /*!< Signal name */
#define BOARD_INITSDRAM_SEMC_DM0_CHANNEL                                      0U   /*!< Signal channel */

/* GPIO_EMC_38 (coord D6), SEMC_DM1 */
/* Routed pin properties */
#define BOARD_INITSDRAM_SEMC_DM1_PERIPHERAL                                 SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAM_SEMC_DM1_SIGNAL                                       DM   /*!< Signal name */
#define BOARD_INITSDRAM_SEMC_DM1_CHANNEL                                      1U   /*!< Signal channel */

/* GPIO_EMC_25 (coord D2), SEMC_RAS */
/* Routed pin properties */
#define BOARD_INITSDRAM_SEMC_RAS_PERIPHERAL                                 SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAM_SEMC_RAS_SIGNAL                                 semc_ras   /*!< Signal name */

/* GPIO_EMC_28 (coord D1), SEMC_WE */
/* Routed pin properties */
#define BOARD_INITSDRAM_SEMC_WE_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAM_SEMC_WE_SIGNAL                                   semc_we   /*!< Signal name */

/* GPIO_EMC_41 (coord C7), ENET_MDIO */
/* Routed pin properties */
#define BOARD_INITSDRAM_ENET_MDIO_PERIPHERAL                                SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAM_ENET_MDIO_SIGNAL                                     CSX   /*!< Signal name */
#define BOARD_INITSDRAM_ENET_MDIO_CHANNEL                                     0U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDRAM(void);

#define BOARD_INITLCD_IOMUXC_GPR_GPR27_GPIO_MUX2_GPIO_SEL_MASK 0x80000000U /*!< GPIO2 and GPIO7 share same IO MUX function, GPIO_MUX2 selects one GPIO function: affected bits mask */

/* GPIO_B0_05 (coord B8), LCDIF_D1/BT_CFG[1] */
/* Routed pin properties */
#define BOARD_INITLCD_LCDIF_D1_PERIPHERAL                                  LCDIF   /*!< Peripheral name */
#define BOARD_INITLCD_LCDIF_D1_SIGNAL                                 lcdif_data   /*!< Signal name */
#define BOARD_INITLCD_LCDIF_D1_CHANNEL                                        1U   /*!< Signal channel */

/* GPIO_B0_06 (coord A8), LCDIF_D2/BT_CFG[2] */
/* Routed pin properties */
#define BOARD_INITLCD_LCDIF_D2_PERIPHERAL                                  LCDIF   /*!< Peripheral name */
#define BOARD_INITLCD_LCDIF_D2_SIGNAL                                 lcdif_data   /*!< Signal name */
#define BOARD_INITLCD_LCDIF_D2_CHANNEL                                        2U   /*!< Signal channel */

/* GPIO_B0_00 (coord D7), LCDIF_CLK */
/* Routed pin properties */
#define BOARD_INITLCD_LCDIF_CLK_PERIPHERAL                                 LCDIF   /*!< Peripheral name */
#define BOARD_INITLCD_LCDIF_CLK_SIGNAL                                 lcdif_clk   /*!< Signal name */

/* GPIO_B0_07 (coord A9), LCDIF_D3/BT_CFG[3] */
/* Routed pin properties */
#define BOARD_INITLCD_LCDIF_D3_PERIPHERAL                                  LCDIF   /*!< Peripheral name */
#define BOARD_INITLCD_LCDIF_D3_SIGNAL                                 lcdif_data   /*!< Signal name */
#define BOARD_INITLCD_LCDIF_D3_CHANNEL                                        3U   /*!< Signal channel */

/* GPIO_B0_08 (coord B9), LCDIF_D4/BT_CFG[4] */
/* Routed pin properties */
#define BOARD_INITLCD_LCDIF_D4_PERIPHERAL                                  LCDIF   /*!< Peripheral name */
#define BOARD_INITLCD_LCDIF_D4_SIGNAL                                 lcdif_data   /*!< Signal name */
#define BOARD_INITLCD_LCDIF_D4_CHANNEL                                        4U   /*!< Signal channel */

/* GPIO_B0_10 (coord D9), LCDIF_D6/BT_CFG[6] */
/* Routed pin properties */
#define BOARD_INITLCD_LCDIF_D6_PERIPHERAL                                  LCDIF   /*!< Peripheral name */
#define BOARD_INITLCD_LCDIF_D6_SIGNAL                                 lcdif_data   /*!< Signal name */
#define BOARD_INITLCD_LCDIF_D6_CHANNEL                                        6U   /*!< Signal channel */

/* GPIO_B0_11 (coord A10), LCDIF_D7/BT_CFG[7] */
/* Routed pin properties */
#define BOARD_INITLCD_LCDIF_D7_PERIPHERAL                                  LCDIF   /*!< Peripheral name */
#define BOARD_INITLCD_LCDIF_D7_SIGNAL                                 lcdif_data   /*!< Signal name */
#define BOARD_INITLCD_LCDIF_D7_CHANNEL                                        7U   /*!< Signal channel */

/* GPIO_B0_12 (coord C10), LCDIF_D8/BT_CFG[8] */
/* Routed pin properties */
#define BOARD_INITLCD_LCDIF_D8_PERIPHERAL                                  LCDIF   /*!< Peripheral name */
#define BOARD_INITLCD_LCDIF_D8_SIGNAL                                 lcdif_data   /*!< Signal name */
#define BOARD_INITLCD_LCDIF_D8_CHANNEL                                        8U   /*!< Signal channel */

/* GPIO_B0_13 (coord D10), LCDIF_D9/BT_CFG[9] */
/* Routed pin properties */
#define BOARD_INITLCD_LCDIF_D9_PERIPHERAL                                  LCDIF   /*!< Peripheral name */
#define BOARD_INITLCD_LCDIF_D9_SIGNAL                                 lcdif_data   /*!< Signal name */
#define BOARD_INITLCD_LCDIF_D9_CHANNEL                                        9U   /*!< Signal channel */

/* GPIO_B0_14 (coord E10), LCDIF_D10/BT_CFG[10] */
/* Routed pin properties */
#define BOARD_INITLCD_LCDIF_D10_PERIPHERAL                                 LCDIF   /*!< Peripheral name */
#define BOARD_INITLCD_LCDIF_D10_SIGNAL                                lcdif_data   /*!< Signal name */
#define BOARD_INITLCD_LCDIF_D10_CHANNEL                                      10U   /*!< Signal channel */

/* GPIO_B0_15 (coord E11), LCDIF_D11/BT_CFG[11] */
/* Routed pin properties */
#define BOARD_INITLCD_LCDIF_D11_PERIPHERAL                                 LCDIF   /*!< Peripheral name */
#define BOARD_INITLCD_LCDIF_D11_SIGNAL                                lcdif_data   /*!< Signal name */
#define BOARD_INITLCD_LCDIF_D11_CHANNEL                                      11U   /*!< Signal channel */

/* GPIO_B1_00 (coord A11), LCDIF_D12 */
/* Routed pin properties */
#define BOARD_INITLCD_LCDIF_D12_PERIPHERAL                                 LCDIF   /*!< Peripheral name */
#define BOARD_INITLCD_LCDIF_D12_SIGNAL                                lcdif_data   /*!< Signal name */
#define BOARD_INITLCD_LCDIF_D12_CHANNEL                                      12U   /*!< Signal channel */

