harishankarn04/MIMXRT1064_Project_LED/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITENET_ENET_RST_GPIO                                       GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITENET_ENET_RST_INIT_GPIO_VALUE                               1U   /*!< GPIO output initial state */
#define BOARD_INITENET_ENET_RST_GPIO_PIN                                      9U   /*!< GPIO pin number */
#define BOARD_INITENET_ENET_RST_GPIO_PIN_MASK                         (1U << 9U)   /*!< GPIO pin mask */
#define BOARD_INITENET_ENET_RST_PORT                                       GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITENET_ENET_RST_PIN                                           9U   /*!< PORT pin number */
#define BOARD_INITENET_ENET_RST_PIN_MASK                              (1U << 9U)   /*!< PORT pin mask */

/* GPIO_AD_B0_10 (coord G13), JTAG_TDO/J21[13]/INT1_COMBO/ENET_INT/J22[6]/U32[11] */
/* Routed pin properties */
#define BOARD_INITENET_PHY_INTR_PERIPHERAL                                 GPIO1   /*!< Peripheral name */
#define BOARD_INITENET_PHY_INTR_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITENET_PHY_INTR_CHANNEL                                      10U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITENET_PHY_INTR_GPIO                                       GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITENET_PHY_INTR_GPIO_PIN                                     10U   /*!< GPIO pin number */
#define BOARD_INITENET_PHY_INTR_GPIO_PIN_MASK                        (1U << 10U)   /*!< GPIO pin mask */
#define BOARD_INITENET_PHY_INTR_PORT                                       GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITENET_PHY_INTR_PIN                                          10U   /*!< PORT pin number */
#define BOARD_INITENET_PHY_INTR_PIN_MASK                             (1U << 10U)   /*!< PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitENET(void);

/* GPIO_SD_B0_01 (coord J3), J24_3_CS */
/* Routed pin properties */
#define BOARD_INITUSDHC_SD1_CLK_PERIPHERAL                                USDHC1   /*!< Peripheral name */
#define BOARD_INITUSDHC_SD1_CLK_SIGNAL                                 usdhc_clk   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSDHC(void);

/* GPIO_SD_B1_07 (coord L4), FlexSPI_CLK */
/* Routed pin properties */
#define BOARD_INITHYPERFLASH_FlexSPI_CLK_PERIPHERAL                      FLEXSPI   /*!< Peripheral name */
#define BOARD_INITHYPERFLASH_FlexSPI_CLK_SIGNAL                   FLEXSPI_A_SCLK   /*!< Signal name */

/* GPIO_SD_B1_10 (coord P4), FlexSPI_D2_A */
/* Routed pin properties */
#define BOARD_INITHYPERFLASH_FlexSPI_D2_A_PERIPHERAL                     FLEXSPI   /*!< Peripheral name */
#define BOARD_INITHYPERFLASH_FlexSPI_D2_A_SIGNAL                 FLEXSPI_A_DATA2   /*!< Signal name */

/* GPIO_SD_B1_08 (coord P3), FlexSPI_D0_A */
/* Routed pin properties */
#define BOARD_INITHYPERFLASH_FlexSPI_D0_A_PERIPHERAL                     FLEXSPI   /*!< Peripheral name */
#define BOARD_INITHYPERFLASH_FlexSPI_D0_A_SIGNAL                 FLEXSPI_A_DATA0   /*!< Signal name */

/* GPIO_SD_B1_09 (coord N4), FlexSPI_D1_A */
/* Routed pin properties */
#define BOARD_INITHYPERFLASH_FlexSPI_D1_A_PERIPHERAL                     FLEXSPI   /*!< Peripheral name */
#define BOARD_INITHYPERFLASH_FlexSPI_D1_A_SIGNAL                 FLEXSPI_A_DATA1   /*!< Signal name */

/* GPIO_SD_B1_03 (coord M4), FlexSPI_D0_B */
/* Routed pin properties */
#define BOARD_INITHYPERFLASH_FlexSPI_D0_B_PERIPHERAL                     FLEXSPI   /*!< Peripheral name */
#define BOARD_INITHYPERFLASH_FlexSPI_D0_B_SIGNAL                 FLEXSPI_B_DATA0   /*!< Signal name */

/* GPIO_SD_B1_06 (coord L3), DisableQSPI */
/* Routed pin properties */
#define BOARD_INITHYPERFLASH_FlexSPI_SS0_PERIPHERAL                      FLEXSPI   /*!< Peripheral name */
#define BOARD_INITHYPERFLASH_FlexSPI_SS0_SIGNAL                  FLEXSPI_A_SS0_B   /*!< Signal name */

/* GPIO_SD_B1_11 (coord P5), FlexSPI_D3_A */
/* Routed pin properties */
#define BOARD_INITHYPERFLASH_FlexSPI_D3_A_PERIPHERAL                     FLEXSPI   /*!< Peripheral name */
#define BOARD_INITHYPERFLASH_FlexSPI_D3_A_SIGNAL                 FLEXSPI_A_DATA3   /*!< Signal name */

/* GPIO_SD_B1_05 (coord N3), FlexSPI_DQS */
/* Routed pin properties */
#define BOARD_INITHYPERFLASH_FlexSPI_DQS_PERIPHERAL                      FLEXSPI   /*!< Peripheral name */
#define BOARD_INITHYPERFLASH_FlexSPI_DQS_SIGNAL                    FLEXSPI_A_DQS   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitHyperFlash(void);

#define BOARD_INITPINSCTS_IOMUXC_GPR_GPR27_GPIO_MUX2_GPIO_SEL_MASK 0x10U /*!< GPIO2 and GPIO7 share same IO MUX function, GPIO_MUX2 selects one GPIO function: affected bits mask */

/* WAKEUP (coord L6), SD_PWREN/USER_BT/SD_PWREN/SD_PWREN */
/* Routed pin properties */
#define BOARD_INITPINSCTS_USER_BT_PERIPHERAL                               GPIO5   /*!< Peripheral name */
#define BOARD_INITPINSCTS_USER_BT_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINSCTS_USER_BT_CHANNEL                                     0U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINSCTS_USER_BT_GPIO                                     GPIO5   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINSCTS_USER_BT_GPIO_PIN                                    0U   /*!< GPIO pin number */
#define BOARD_INITPINSCTS_USER_BT_GPIO_PIN_MASK                       (1U << 0U)   /*!< GPIO pin mask */
#define BOARD_INITPINSCTS_USER_BT_PORT                                     GPIO5   /*!< PORT peripheral base pointer */
#define BOARD_INITPINSCTS_USER_BT_PIN                                         0U   /*!< PORT pin number */
#define BOARD_INITPINSCTS_USER_BT_PIN_MASK                            (1U << 0U)   /*!< PORT pin mask */

/* GPIO_B0_04 (coord C8), LCDIF_D0/BT_CFG[0]/LCDIF_D0/BT_CFG[0]/CPU_LED/LCDIF_D0/BT_CFG[0]/LCDIF_D0/BT_CFG[0]/LCDIF_D0/BT_CFG[0]/LCDIF_D0/BT_CFG[0] */
/* Routed pin properties */
#define BOARD_INITPINSCTS_CPU_LED_PERIPHERAL                               GPIO2   /*!< Peripheral name */
#define BOARD_INITPINSCTS_CPU_LED_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINSCTS_CPU_LED_CHANNEL                                     4U   /*!< Signal channel */

