harishankarn04/MIMXRT1064_Project_LED/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINSCTS_CPU_LED_GPIO                                     GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINSCTS_CPU_LED_INIT_GPIO_VALUE                             0U   /*!< GPIO output initial state */
#define BOARD_INITPINSCTS_CPU_LED_GPIO_PIN                                    4U   /*!< GPIO pin number */
#define BOARD_INITPINSCTS_CPU_LED_GPIO_PIN_MASK                       (1U << 4U)   /*!< GPIO pin mask */
#define BOARD_INITPINSCTS_CPU_LED_PORT                                     GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINSCTS_CPU_LED_PIN                                         4U   /*!< PORT pin number */
#define BOARD_INITPINSCTS_CPU_LED_PIN_MASK                            (1U << 4U)   /*!< PORT pin mask */

/* GPIO_B1_13 (coord D14), WDOG_B */
/* Routed pin properties */
#define BOARD_INITPINSCTS_WDOG_B_PERIPHERAL                                WDOG1   /*!< Peripheral name */
#define BOARD_INITPINSCTS_WDOG_B_SIGNAL                                   wdog_b   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPinsCTS(void);

#define BOARD_ENET1PINS_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK 0x4000U /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */
#define BOARD_ENET1PINS_IOMUXC_GPR_GPR27_GPIO_MUX2_GPIO_SEL_MASK 0x10000000U /*!< GPIO2 and GPIO7 share same IO MUX function, GPIO_MUX2 selects one GPIO function: affected bits mask */

/* GPIO_EMC_40 (coord A7), ENET_MDC */
/* Routed pin properties */
#define BOARD_ENET1PINS_ENET_MDC_PERIPHERAL                                 ENET   /*!< Peripheral name */
#define BOARD_ENET1PINS_ENET_MDC_SIGNAL                                 enet_mdc   /*!< Signal name */

/* GPIO_B1_08 (coord A12), ENET_TXD1 */
/* Routed pin properties */
#define BOARD_ENET1PINS_ENET_TXD1_PERIPHERAL                                ENET   /*!< Peripheral name */
#define BOARD_ENET1PINS_ENET_TXD1_SIGNAL                            enet_tx_data   /*!< Signal name */
#define BOARD_ENET1PINS_ENET_TXD1_CHANNEL                                     1U   /*!< Signal channel */

/* GPIO_B1_09 (coord A13), ENET_TXEN */
/* Routed pin properties */
#define BOARD_ENET1PINS_ENET_TXEN_PERIPHERAL                                ENET   /*!< Peripheral name */
#define BOARD_ENET1PINS_ENET_TXEN_SIGNAL                              enet_tx_en   /*!< Signal name */

/* GPIO_B1_07 (coord B12), ENET_TXD0 */
/* Routed pin properties */
#define BOARD_ENET1PINS_ENET_TXD0_PERIPHERAL                                ENET   /*!< Peripheral name */
#define BOARD_ENET1PINS_ENET_TXD0_SIGNAL                            enet_tx_data   /*!< Signal name */
#define BOARD_ENET1PINS_ENET_TXD0_CHANNEL                                     0U   /*!< Signal channel */

/* GPIO_B1_10 (coord B13), ENET_TX_CLK */
/* Routed pin properties */
#define BOARD_ENET1PINS_ENET_TX_CLK_PERIPHERAL                              ENET   /*!< Peripheral name */
#define BOARD_ENET1PINS_ENET_TX_CLK_SIGNAL                           enet_tx_clk   /*!< Signal name */

/* GPIO_EMC_41 (coord C7), ENET_MDIO */
/* Routed pin properties */
#define BOARD_ENET1PINS_ENET_MDIO_PERIPHERAL                                ENET   /*!< Peripheral name */
#define BOARD_ENET1PINS_ENET_MDIO_SIGNAL                               enet_mdio   /*!< Signal name */

/* GPIO_B1_06 (coord C12), ENET_CRS_DV */
/* Routed pin properties */
#define BOARD_ENET1PINS_ENET_CRS_DV_PERIPHERAL                              ENET   /*!< Peripheral name */
#define BOARD_ENET1PINS_ENET_CRS_DV_SIGNAL                            enet_rx_en   /*!< Signal name */

/* GPIO_B1_11 (coord C13), ENET_RXER */
/* Routed pin properties */
#define BOARD_ENET1PINS_ENET_RXER_PERIPHERAL                                ENET   /*!< Peripheral name */
#define BOARD_ENET1PINS_ENET_RXER_SIGNAL                              enet_rx_er   /*!< Signal name */

/* GPIO_B1_05 (coord D12), ENET_RXD1 */
/* Routed pin properties */
#define BOARD_ENET1PINS_ENET_RXD1_PERIPHERAL                                ENET   /*!< Peripheral name */
#define BOARD_ENET1PINS_ENET_RXD1_SIGNAL                            enet_rx_data   /*!< Signal name */
#define BOARD_ENET1PINS_ENET_RXD1_CHANNEL                                     1U   /*!< Signal channel */

/* GPIO_B1_04 (coord E12), ENET_RXD0 */
/* Routed pin properties */
#define BOARD_ENET1PINS_ENET_RXD0_PERIPHERAL                                ENET   /*!< Peripheral name */
#define BOARD_ENET1PINS_ENET_RXD0_SIGNAL                            enet_rx_data   /*!< Signal name */
#define BOARD_ENET1PINS_ENET_RXD0_CHANNEL                                     0U   /*!< Signal channel */

/* GPIO_AD_B0_14 (coord H14), CAN2_TX/U12[1]/ENET1_INT/CAN2_TX/U12[1]/CAN2_TX/U12[1] */
/* Routed pin properties */
#define BOARD_ENET1PINS_ENET1_INT_PERIPHERAL                               GPIO1   /*!< Peripheral name */
#define BOARD_ENET1PINS_ENET1_INT_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_ENET1PINS_ENET1_INT_CHANNEL                                    14U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_ENET1PINS_ENET1_INT_GPIO                                     GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_ENET1PINS_ENET1_INT_GPIO_PIN                                   14U   /*!< GPIO pin number */
#define BOARD_ENET1PINS_ENET1_INT_GPIO_PIN_MASK                      (1U << 14U)   /*!< GPIO pin mask */
#define BOARD_ENET1PINS_ENET1_INT_PORT                                     GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_ENET1PINS_ENET1_INT_PIN                                        14U   /*!< PORT pin number */
#define BOARD_ENET1PINS_ENET1_INT_PIN_MASK                           (1U << 14U)   /*!< PORT pin mask */

/* GPIO_B1_12 (coord D13), SD_CD_SW/ENET1_RST/SD_CD_SW/SD_CD_SW */
/* Routed pin properties */
#define BOARD_ENET1PINS_ENET1_RST_PERIPHERAL                               GPIO2   /*!< Peripheral name */
#define BOARD_ENET1PINS_ENET1_RST_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_ENET1PINS_ENET1_RST_CHANNEL                                    28U   /*!< Signal channel */

