harishankarn04/MIMXRT1064_Project_LED/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_ENET1PINS_ENET1_RST_GPIO                                     GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_ENET1PINS_ENET1_RST_INIT_GPIO_VALUE                             1U   /*!< GPIO output initial state */
#define BOARD_ENET1PINS_ENET1_RST_GPIO_PIN                                   28U   /*!< GPIO pin number */
#define BOARD_ENET1PINS_ENET1_RST_GPIO_PIN_MASK                      (1U << 28U)   /*!< GPIO pin mask */
#define BOARD_ENET1PINS_ENET1_RST_PORT                                     GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_ENET1PINS_ENET1_RST_PIN                                        28U   /*!< PORT pin number */
#define BOARD_ENET1PINS_ENET1_RST_PIN_MASK                           (1U << 28U)   /*!< PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void Board_Enet1Pins(void);

#define BOARD_ENET2PINS_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK 0x80000000U /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */
#define BOARD_ENET2PINS_IOMUXC_GPR_GPR27_GPIO_MUX2_GPIO_SEL_MASK 0x04U /*!< GPIO2 and GPIO7 share same IO MUX function, GPIO_MUX2 selects one GPIO function: affected bits mask */

/* GPIO_B0_00 (coord D7), LCDIF_CLK */
/* Routed pin properties */
#define BOARD_ENET2PINS_LCDIF_CLK_PERIPHERAL                               ENET2   /*!< Peripheral name */
#define BOARD_ENET2PINS_LCDIF_CLK_SIGNAL                                enet_mdc   /*!< Signal name */

/* GPIO_B1_15 (coord B14), USB_HOST_PWR/BACKLIGHT_CTL */
/* Routed pin properties */
#define BOARD_ENET2PINS_BACKLIGHT_CTL_PERIPHERAL                           ENET2   /*!< Peripheral name */
#define BOARD_ENET2PINS_BACKLIGHT_CTL_SIGNAL                        enet_tx_data   /*!< Signal name */
#define BOARD_ENET2PINS_BACKLIGHT_CTL_CHANNEL                                 1U   /*!< Signal channel */

/* GPIO_B0_14 (coord E10), LCDIF_D10/BT_CFG[10] */
/* Routed pin properties */
#define BOARD_ENET2PINS_LCDIF_D10_PERIPHERAL                               ENET2   /*!< Peripheral name */
#define BOARD_ENET2PINS_LCDIF_D10_SIGNAL                              enet_tx_en   /*!< Signal name */

/* GPIO_B1_14 (coord C14), SD0_VSELECT */
/* Routed pin properties */
#define BOARD_ENET2PINS_SD0_VSELECT_PERIPHERAL                             ENET2   /*!< Peripheral name */
#define BOARD_ENET2PINS_SD0_VSELECT_SIGNAL                          enet_tx_data   /*!< Signal name */
#define BOARD_ENET2PINS_SD0_VSELECT_CHANNEL                                   0U   /*!< Signal channel */

/* GPIO_SD_B0_01 (coord J3), J24_3_CS */
/* Routed pin properties */
#define BOARD_ENET2PINS_SD1_CLK_PERIPHERAL                                 ENET2   /*!< Peripheral name */
#define BOARD_ENET2PINS_SD1_CLK_SIGNAL                               enet_tx_clk   /*!< Signal name */

/* GPIO_B0_01 (coord E7), LCDIF_ENABLE */
/* Routed pin properties */
#define BOARD_ENET2PINS_LCDIF_ENABLE_PERIPHERAL                            ENET2   /*!< Peripheral name */
#define BOARD_ENET2PINS_LCDIF_ENABLE_SIGNAL                            enet_mdio   /*!< Signal name */

/* GPIO_B0_10 (coord D9), LCDIF_D6/BT_CFG[6] */
/* Routed pin properties */
#define BOARD_ENET2PINS_LCDIF_D6_PERIPHERAL                                ENET2   /*!< Peripheral name */
#define BOARD_ENET2PINS_LCDIF_D6_SIGNAL                                 enet_crs   /*!< Signal name */

/* GPIO_B1_00 (coord A11), LCDIF_D12 */
/* Routed pin properties */
#define BOARD_ENET2PINS_LCDIF_D12_PERIPHERAL                               ENET2   /*!< Peripheral name */
#define BOARD_ENET2PINS_LCDIF_D12_SIGNAL                              enet_rx_er   /*!< Signal name */

/* GPIO_B1_02 (coord C11), LCDIF_D14 */
/* Routed pin properties */
#define BOARD_ENET2PINS_LCDIF_D14_PERIPHERAL                               ENET2   /*!< Peripheral name */
#define BOARD_ENET2PINS_LCDIF_D14_SIGNAL                            enet_rx_data   /*!< Signal name */
#define BOARD_ENET2PINS_LCDIF_D14_CHANNEL                                     1U   /*!< Signal channel */

/* GPIO_B1_01 (coord B11), LCDIF_D13 */
/* Routed pin properties */
#define BOARD_ENET2PINS_LCDIF_D13_PERIPHERAL                               ENET2   /*!< Peripheral name */
#define BOARD_ENET2PINS_LCDIF_D13_SIGNAL                            enet_rx_data   /*!< Signal name */
#define BOARD_ENET2PINS_LCDIF_D13_CHANNEL                                     0U   /*!< Signal channel */

/* GPIO_B0_02 (coord E8), LCDIF_HSYNC/ENET2_INT/LCDIF_HSYNC/LCDIF_HSYNC */
/* Routed pin properties */
#define BOARD_ENET2PINS_ENET2_INT_PERIPHERAL                               GPIO2   /*!< Peripheral name */
#define BOARD_ENET2PINS_ENET2_INT_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_ENET2PINS_ENET2_INT_CHANNEL                                     2U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_ENET2PINS_ENET2_INT_GPIO                                     GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_ENET2PINS_ENET2_INT_GPIO_PIN                                    2U   /*!< GPIO pin number */
#define BOARD_ENET2PINS_ENET2_INT_GPIO_PIN_MASK                       (1U << 2U)   /*!< GPIO pin mask */
#define BOARD_ENET2PINS_ENET2_INT_PORT                                     GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_ENET2PINS_ENET2_INT_PIN                                         2U   /*!< PORT pin number */
#define BOARD_ENET2PINS_ENET2_INT_PIN_MASK                            (1U << 2U)   /*!< PORT pin mask */

/* GPIO_AD_B1_15 (coord J14), SAI1_TX_SYNC/CSI_D2/J35[6]/U13[13]/ENET2_RST/SAI1_TX_SYNC/CSI_D2/J35[6]/U13[13]/SAI1_TX_SYNC/CSI_D2/J35[6]/U13[13] */
/* Routed pin properties */
#define BOARD_ENET2PINS_ENET2_RST_PERIPHERAL                               GPIO1   /*!< Peripheral name */
#define BOARD_ENET2PINS_ENET2_RST_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_ENET2PINS_ENET2_RST_CHANNEL                                    31U   /*!< Signal channel */

