harishankarn04/MIMXRT1064_Project_LED/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_ENET2PINS_ENET2_RST_GPIO                                     GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_ENET2PINS_ENET2_RST_GPIO_PIN                                   31U   /*!< GPIO pin number */
#define BOARD_ENET2PINS_ENET2_RST_GPIO_PIN_MASK                      (1U << 31U)   /*!< GPIO pin mask */
#define BOARD_ENET2PINS_ENET2_RST_PORT                                     GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_ENET2PINS_ENET2_RST_PIN                                        31U   /*!< PORT pin number */
#define BOARD_ENET2PINS_ENET2_RST_PIN_MASK                           (1U << 31U)   /*!< PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void Board_Enet2Pins(void);

/* USB_OTG1_DP (coord L8), OTG1_DP */
/* Routed pin properties */
#define BOARD_USBOTG_PINS_OTG1_DP_PERIPHERAL                                USB1   /*!< Peripheral name */
#define BOARD_USBOTG_PINS_OTG1_DP_SIGNAL                             usb_otg1_dp   /*!< Signal name */

/* USB_OTG1_DN (coord M8), OTG1_DN */
/* Routed pin properties */
#define BOARD_USBOTG_PINS_OTG1_DN_PERIPHERAL                                USB1   /*!< Peripheral name */
#define BOARD_USBOTG_PINS_OTG1_DN_SIGNAL                             usb_otg1_dn   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void Board_USBOTG_Pins(void);

#define BOARD_UART_DEBUG_PINS_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK 0x100000U /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */

/* GPIO_AD_B1_04 (coord L12), GPIO! */
/* Routed pin properties */
#define BOARD_UART_DEBUG_PINS_UART1_TX_EN_PERIPHERAL                       GPIO1   /*!< Peripheral name */
#define BOARD_UART_DEBUG_PINS_UART1_TX_EN_SIGNAL                         gpio_io   /*!< Signal name */
#define BOARD_UART_DEBUG_PINS_UART1_TX_EN_CHANNEL                            20U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_UART_DEBUG_PINS_UART1_TX_EN_GPIO                             GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_UART_DEBUG_PINS_UART1_TX_EN_INIT_GPIO_VALUE                     0U   /*!< GPIO output initial state */
#define BOARD_UART_DEBUG_PINS_UART1_TX_EN_GPIO_PIN                           20U   /*!< GPIO pin number */
#define BOARD_UART_DEBUG_PINS_UART1_TX_EN_GPIO_PIN_MASK              (1U << 20U)   /*!< GPIO pin mask */
#define BOARD_UART_DEBUG_PINS_UART1_TX_EN_PORT                             GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_UART_DEBUG_PINS_UART1_TX_EN_PIN                                20U   /*!< PORT pin number */
#define BOARD_UART_DEBUG_PINS_UART1_TX_EN_PIN_MASK                   (1U << 20U)   /*!< PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void Board_UART_Debug_Pins(void);

#define BOARD_LPSPI2_PINS_IOMUXC_GPR_GPR27_GPIO_MUX2_GPIO_SEL_MASK 0x0200U /*!< GPIO2 and GPIO7 share same IO MUX function, GPIO_MUX2 selects one GPIO function: affected bits mask */

/* GPIO_SD_B1_06 (coord L3), DisableQSPI */
/* Routed pin properties */
#define BOARD_LPSPI2_PINS_FlexSPI_SS0_PERIPHERAL                          LPSPI2   /*!< Peripheral name */
#define BOARD_LPSPI2_PINS_FlexSPI_SS0_SIGNAL                                PCS0   /*!< Signal name */

/* GPIO_SD_B1_07 (coord L4), FlexSPI_CLK */
/* Routed pin properties */
#define BOARD_LPSPI2_PINS_FlexSPI_CLK_PERIPHERAL                          LPSPI2   /*!< Peripheral name */
#define BOARD_LPSPI2_PINS_FlexSPI_CLK_SIGNAL                                 SCK   /*!< Signal name */

/* GPIO_SD_B1_08 (coord P3), FlexSPI_D0_A */
/* Routed pin properties */
#define BOARD_LPSPI2_PINS_FlexSPI_D0_A_PERIPHERAL                         LPSPI2   /*!< Peripheral name */
#define BOARD_LPSPI2_PINS_FlexSPI_D0_A_SIGNAL                                SDO   /*!< Signal name */

/* GPIO_SD_B1_09 (coord N4), FlexSPI_D1_A */
/* Routed pin properties */
#define BOARD_LPSPI2_PINS_FlexSPI_D1_A_PERIPHERAL                         LPSPI2   /*!< Peripheral name */
#define BOARD_LPSPI2_PINS_FlexSPI_D1_A_SIGNAL                                SDI   /*!< Signal name */

/* GPIO_B0_09 (coord C9), LCDIF_D5/BT_CFG[5]/SPI_Flash_WP/LCDIF_D5/BT_CFG[5]/LCDIF_D5/BT_CFG[5] */
/* Routed pin properties */
#define BOARD_LPSPI2_PINS_SPI_Flash_WP_PERIPHERAL                          GPIO2   /*!< Peripheral name */
#define BOARD_LPSPI2_PINS_SPI_Flash_WP_SIGNAL                            gpio_io   /*!< Signal name */
#define BOARD_LPSPI2_PINS_SPI_Flash_WP_CHANNEL                                9U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_LPSPI2_PINS_SPI_Flash_WP_GPIO                                GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_LPSPI2_PINS_SPI_Flash_WP_GPIO_PIN                               9U   /*!< GPIO pin number */
#define BOARD_LPSPI2_PINS_SPI_Flash_WP_GPIO_PIN_MASK                  (1U << 9U)   /*!< GPIO pin mask */
#define BOARD_LPSPI2_PINS_SPI_Flash_WP_PORT                                GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_LPSPI2_PINS_SPI_Flash_WP_PIN                                    9U   /*!< PORT pin number */
#define BOARD_LPSPI2_PINS_SPI_Flash_WP_PIN_MASK                       (1U << 9U)   /*!< PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void Board_LPSPI2_Pins(void);

#define BOARD_I2C1_PINS_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK 0x0800U /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */

/* GPIO_AD_B0_11 (coord G10), INTR */
/* Routed pin properties */
#define BOARD_I2C1_PINS_Interrupt_Temp_PERIPHERAL                          GPIO1   /*!< Peripheral name */
#define BOARD_I2C1_PINS_Interrupt_Temp_SIGNAL                            gpio_io   /*!< Signal name */
#define BOARD_I2C1_PINS_Interrupt_Temp_CHANNEL                               11U   /*!< Signal channel */

