harishankarn04/MIMXRT1064_Project_LED/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_I2C1_PINS_Interrupt_Temp_GPIO                                GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_I2C1_PINS_Interrupt_Temp_GPIO_PIN                              11U   /*!< GPIO pin number */
#define BOARD_I2C1_PINS_Interrupt_Temp_GPIO_PIN_MASK                 (1U << 11U)   /*!< GPIO pin mask */
#define BOARD_I2C1_PINS_Interrupt_Temp_PORT                                GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_I2C1_PINS_Interrupt_Temp_PIN                                   11U   /*!< PORT pin number */
#define BOARD_I2C1_PINS_Interrupt_Temp_PIN_MASK                      (1U << 11U)   /*!< PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void Board_I2C1_Pins(void);

/* GPIO_SD_B1_11 (coord P5), FlexSPI_D3_A */
/* Routed pin properties */
#define BOARD_I2C2_PINS_FlexSPI_D3_A_PERIPHERAL                           LPI2C2   /*!< Peripheral name */
#define BOARD_I2C2_PINS_FlexSPI_D3_A_SIGNAL                                  SCL   /*!< Signal name */

/* GPIO_SD_B1_10 (coord P4), FlexSPI_D2_A */
/* Routed pin properties */
#define BOARD_I2C2_PINS_FlexSPI_D2_A_PERIPHERAL                           LPI2C2   /*!< Peripheral name */
#define BOARD_I2C2_PINS_FlexSPI_D2_A_SIGNAL                                  SDA   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void Board_I2C2_Pins(void);

#define BOARD_LPSPI1_LED_PINS_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK 0x0FE0800CU /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */
#define BOARD_LPSPI1_LED_PINS_IOMUXC_GPR_GPR27_GPIO_MUX2_GPIO_SEL_MASK 0x080000U /*!< GPIO2 and GPIO7 share same IO MUX function, GPIO_MUX2 selects one GPIO function: affected bits mask */
#define BOARD_LPSPI1_LED_PINS_IOMUXC_GPR_GPR28_GPIO_MUX3_GPIO_SEL_MASK 0x50U /*!< GPIO3 and GPIO8 share same IO MUX function, GPIO_MUX3 selects one GPIO function: affected bits mask */

/* GPIO_AD_B1_12 (coord H12), PCS0/SAI1_RXD/CSI_D5/J35[5]/U13[16]/SAI1_RXD/CSI_D5/J35[5]/U13[16] */
/* Routed pin properties */
#define BOARD_LPSPI1_LED_PINS_CSI_D5_PERIPHERAL                           LPSPI3   /*!< Peripheral name */
#define BOARD_LPSPI1_LED_PINS_CSI_D5_SIGNAL                                 PCS0   /*!< Signal name */

/* GPIO_AD_B0_00 (coord M14), SCK */
/* Routed pin properties */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_DF0_PERIPHERAL                   LPSPI3   /*!< Peripheral name */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_DF0_SIGNAL                          SCK   /*!< Signal name */

/* GPIO_AD_B1_10 (coord L13), SAI1_RX_SYNC/CSI_D7/J35[9]/J23[1]/LED_Driver_LE/SAI1_RX_SYNC/CSI_D7/J35[9]/J23[1]/SAI1_RX_SYNC/CSI_D7/J35[9]/J23[1] */
/* Routed pin properties */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_LE_PERIPHERAL                     GPIO6   /*!< Peripheral name */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_LE_SIGNAL                       gpio_io   /*!< Signal name */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_LE_CHANNEL                          26U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_LE_GPIO                           GPIO6   /*!< GPIO peripheral base pointer */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_LE_INIT_GPIO_VALUE                   1U   /*!< GPIO output initial state */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_LE_GPIO_PIN                         26U   /*!< GPIO pin number */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_LE_GPIO_PIN_MASK            (1U << 26U)   /*!< GPIO pin mask */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_LE_PORT                           GPIO6   /*!< PORT peripheral base pointer */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_LE_PIN                              26U   /*!< PORT pin number */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_LE_PIN_MASK                 (1U << 26U)   /*!< PORT pin mask */

/* GPIO_SD_B1_04 (coord P2), FlexSPI_CLK_B/LED_Driver_OE_R/FlexSPI_CLK_B/FlexSPI_CLK_B */
/* Routed pin properties */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_R_PERIPHERAL                   GPIO8   /*!< Peripheral name */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_R_SIGNAL                     gpio_io   /*!< Signal name */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_R_CHANNEL                         4U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_R_GPIO                         GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_R_INIT_GPIO_VALUE                 1U   /*!< GPIO output initial state */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_R_GPIO_PIN                        4U   /*!< GPIO pin number */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_R_GPIO_PIN_MASK           (1U << 4U)   /*!< GPIO pin mask */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_R_PORT                         GPIO8   /*!< PORT peripheral base pointer */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_R_PIN                             4U   /*!< PORT pin number */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_R_PIN_MASK                (1U << 4U)   /*!< PORT pin mask */

/* GPIO_AD_B1_09 (coord M13), SAI1_MCLK/CSI_D8/J35[11]/LED_Driver_OE_G/SAI1_MCLK/CSI_D8/J35[11]/SAI1_MCLK/CSI_D8/J35[11] */
/* Routed pin properties */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_G_PERIPHERAL                   GPIO1   /*!< Peripheral name */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_G_SIGNAL                     gpio_io   /*!< Signal name */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_G_CHANNEL                        25U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_G_GPIO                         GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_G_INIT_GPIO_VALUE                 1U   /*!< GPIO output initial state */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_G_GPIO_PIN                       25U   /*!< GPIO pin number */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_G_GPIO_PIN_MASK          (1U << 25U)   /*!< GPIO pin mask */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_G_PORT                         GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_G_PIN                            25U   /*!< PORT pin number */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_G_PIN_MASK               (1U << 25U)   /*!< PORT pin mask */

