harishankarn04/MIMXRT1064_Project_LED/board/pin_mux.h
/* GPIO_AD_B1_05 (coord K12), CSI_MCLK/J35[12]/J23[4]/LED_Driver_OE_B/CSI_MCLK/J35[12]/J23[4]/CSI_MCLK/J35[12]/J23[4] */
/* Routed pin properties */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_B_PERIPHERAL                   GPIO1   /*!< Peripheral name */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_B_SIGNAL                     gpio_io   /*!< Signal name */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_B_CHANNEL                        21U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_B_GPIO                         GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_B_INIT_GPIO_VALUE                 1U   /*!< GPIO output initial state */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_B_GPIO_PIN                       21U   /*!< GPIO pin number */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_B_GPIO_PIN_MASK          (1U << 21U)   /*!< GPIO pin mask */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_B_PORT                         GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_B_PIN                            21U   /*!< PORT pin number */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_OE_B_PIN_MASK               (1U << 21U)   /*!< PORT pin mask */

/* GPIO_AD_B1_11 (coord J13), SAI1_RX_BCLK/CSI_D6/J35[7]/J23[2]/LED_Driver_EF_Int/SAI1_RX_BCLK/CSI_D6/J35[7]/J23[2]/SAI1_RX_BCLK/CSI_D6/J35[7]/J23[2] */
/* Routed pin properties */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_EF_Int_PERIPHERAL                 GPIO1   /*!< Peripheral name */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_EF_Int_SIGNAL                   gpio_io   /*!< Signal name */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_EF_Int_CHANNEL                      27U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_EF_Int_GPIO                       GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_EF_Int_GPIO_PIN                     27U   /*!< GPIO pin number */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_EF_Int_GPIO_PIN_MASK        (1U << 27U)   /*!< GPIO pin mask */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_EF_Int_PORT                       GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_EF_Int_PIN                          27U   /*!< PORT pin number */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_EF_Int_PIN_MASK             (1U << 27U)   /*!< PORT pin mask */

/* GPIO_B1_03 (coord D11), LCDIF_D15/LED_Driver_DetMode/LCDIF_D15/LCDIF_D15 */
/* Routed pin properties */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_DetMode_PERIPHERAL                GPIO2   /*!< Peripheral name */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_DetMode_SIGNAL                  gpio_io   /*!< Signal name */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_DetMode_CHANNEL                     19U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_DetMode_GPIO                      GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_DetMode_INIT_GPIO_VALUE              1U   /*!< GPIO output initial state */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_DetMode_GPIO_PIN                    19U   /*!< GPIO pin number */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_DetMode_GPIO_PIN_MASK       (1U << 19U)   /*!< GPIO pin mask */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_DetMode_PORT                      GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_DetMode_PIN                         19U   /*!< PORT pin number */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_DetMode_PIN_MASK            (1U << 19U)   /*!< PORT pin mask */

/* GPIO_AD_B0_15 (coord L10), CAN2_RX/U12[4]/LED_Driver_GrdlDelay/CAN2_RX/U12[4]/CAN2_RX/U12[4] */
/* Routed pin properties */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_GrdlDelay_PERIPHERAL              GPIO1   /*!< Peripheral name */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_GrdlDelay_SIGNAL                gpio_io   /*!< Signal name */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_GrdlDelay_CHANNEL                   15U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_GrdlDelay_GPIO                    GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_GrdlDelay_INIT_GPIO_VALUE            0U   /*!< GPIO output initial state */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_GrdlDelay_GPIO_PIN                  15U   /*!< GPIO pin number */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_GrdlDelay_GPIO_PIN_MASK     (1U << 15U)   /*!< GPIO pin mask */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_GrdlDelay_PORT                    GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_GrdlDelay_PIN                       15U   /*!< PORT pin number */
#define BOARD_LPSPI1_LED_PINS_LED_Driver_GrdlDelay_PIN_MASK          (1U << 15U)   /*!< PORT pin mask */

/* GPIO_AD_B0_02 (coord M11), J24_2_LE */
/* Routed pin properties */
#define BOARD_LPSPI1_LED_PINS_LED_LE_PERIPHERAL                            GPIO1   /*!< Peripheral name */
#define BOARD_LPSPI1_LED_PINS_LED_LE_SIGNAL                              gpio_io   /*!< Signal name */
#define BOARD_LPSPI1_LED_PINS_LED_LE_CHANNEL                                  2U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_LPSPI1_LED_PINS_LED_LE_GPIO                                  GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_LPSPI1_LED_PINS_LED_LE_INIT_GPIO_VALUE                          0U   /*!< GPIO output initial state */
#define BOARD_LPSPI1_LED_PINS_LED_LE_GPIO_PIN                                 2U   /*!< GPIO pin number */
#define BOARD_LPSPI1_LED_PINS_LED_LE_GPIO_PIN_MASK                    (1U << 2U)   /*!< GPIO pin mask */
#define BOARD_LPSPI1_LED_PINS_LED_LE_PORT                                  GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_LPSPI1_LED_PINS_LED_LE_PIN                                      2U   /*!< PORT pin number */
#define BOARD_LPSPI1_LED_PINS_LED_LE_PIN_MASK                         (1U << 2U)   /*!< PORT pin mask */

/* GPIO_AD_B0_03 (coord G11), J24_1_OEn */
/* Routed pin properties */
#define BOARD_LPSPI1_LED_PINS_LED_OE_PERIPHERAL                            GPIO1   /*!< Peripheral name */
#define BOARD_LPSPI1_LED_PINS_LED_OE_SIGNAL                              gpio_io   /*!< Signal name */
#define BOARD_LPSPI1_LED_PINS_LED_OE_CHANNEL                                  3U   /*!< Signal channel */

