harishankarn04/MIMXRT1064_Project_LED/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_LPSPI1_LED_PINS_LED_OE_GPIO                                  GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_LPSPI1_LED_PINS_LED_OE_INIT_GPIO_VALUE                          1U   /*!< GPIO output initial state */
#define BOARD_LPSPI1_LED_PINS_LED_OE_GPIO_PIN                                 3U   /*!< GPIO pin number */
#define BOARD_LPSPI1_LED_PINS_LED_OE_GPIO_PIN_MASK                    (1U << 3U)   /*!< GPIO pin mask */
#define BOARD_LPSPI1_LED_PINS_LED_OE_PORT                                  GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_LPSPI1_LED_PINS_LED_OE_PIN                                      3U   /*!< PORT pin number */
#define BOARD_LPSPI1_LED_PINS_LED_OE_PIN_MASK                         (1U << 3U)   /*!< PORT pin mask */

/* GPIO_SD_B0_01 (coord J3), J24_3_CS */
/* Routed pin properties */
#define BOARD_LPSPI1_LED_PINS_LED_CSn_PERIPHERAL                          LPSPI1   /*!< Peripheral name */
#define BOARD_LPSPI1_LED_PINS_LED_CSn_SIGNAL                                PCS0   /*!< Signal name */

/* GPIO_SD_B0_02 (coord J1), J24_4_SDO */
/* Routed pin properties */
#define BOARD_LPSPI1_LED_PINS_LED_SDO_PERIPHERAL                          LPSPI1   /*!< Peripheral name */
#define BOARD_LPSPI1_LED_PINS_LED_SDO_SIGNAL                                 SDO   /*!< Signal name */

/* GPIO_SD_B0_03 (coord K1), J24_5_SDI */
/* Routed pin properties */
#define BOARD_LPSPI1_LED_PINS_LED_SDI_PERIPHERAL                          LPSPI1   /*!< Peripheral name */
#define BOARD_LPSPI1_LED_PINS_LED_SDI_SIGNAL                                 SDI   /*!< Signal name */

/* GPIO_SD_B0_00 (coord J4), J24_6_CLK */
/* Routed pin properties */
#define BOARD_LPSPI1_LED_PINS_LED_CLK_PERIPHERAL                          LPSPI1   /*!< Peripheral name */
#define BOARD_LPSPI1_LED_PINS_LED_CLK_SIGNAL                                 SCK   /*!< Signal name */

/* GPIO_AD_B1_07 (coord K10), A0 */
/* Routed pin properties */
#define BOARD_LPSPI1_LED_PINS_A0_PERIPHERAL                                GPIO1   /*!< Peripheral name */
#define BOARD_LPSPI1_LED_PINS_A0_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_LPSPI1_LED_PINS_A0_CHANNEL                                     23U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_LPSPI1_LED_PINS_A0_GPIO                                      GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_LPSPI1_LED_PINS_A0_INIT_GPIO_VALUE                              0U   /*!< GPIO output initial state */
#define BOARD_LPSPI1_LED_PINS_A0_GPIO_PIN                                    23U   /*!< GPIO pin number */
#define BOARD_LPSPI1_LED_PINS_A0_GPIO_PIN_MASK                       (1U << 23U)   /*!< GPIO pin mask */
#define BOARD_LPSPI1_LED_PINS_A0_PORT                                      GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_LPSPI1_LED_PINS_A0_PIN                                         23U   /*!< PORT pin number */
#define BOARD_LPSPI1_LED_PINS_A0_PIN_MASK                            (1U << 23U)   /*!< PORT pin mask */

/* GPIO_AD_B1_06 (coord J12), A1 */
/* Routed pin properties */
#define BOARD_LPSPI1_LED_PINS_A1_PERIPHERAL                                GPIO1   /*!< Peripheral name */
#define BOARD_LPSPI1_LED_PINS_A1_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_LPSPI1_LED_PINS_A1_CHANNEL                                     22U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_LPSPI1_LED_PINS_A1_GPIO                                      GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_LPSPI1_LED_PINS_A1_INIT_GPIO_VALUE                              0U   /*!< GPIO output initial state */
#define BOARD_LPSPI1_LED_PINS_A1_GPIO_PIN                                    22U   /*!< GPIO pin number */
#define BOARD_LPSPI1_LED_PINS_A1_GPIO_PIN_MASK                       (1U << 22U)   /*!< GPIO pin mask */
#define BOARD_LPSPI1_LED_PINS_A1_PORT                                      GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_LPSPI1_LED_PINS_A1_PIN                                         22U   /*!< PORT pin number */
#define BOARD_LPSPI1_LED_PINS_A1_PIN_MASK                            (1U << 22U)   /*!< PORT pin mask */

/* GPIO_AD_B1_08 (coord H13), A2 */
/* Routed pin properties */
#define BOARD_LPSPI1_LED_PINS_A2_PERIPHERAL                                GPIO1   /*!< Peripheral name */
#define BOARD_LPSPI1_LED_PINS_A2_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_LPSPI1_LED_PINS_A2_CHANNEL                                     24U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_LPSPI1_LED_PINS_A2_GPIO                                      GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_LPSPI1_LED_PINS_A2_INIT_GPIO_VALUE                              0U   /*!< GPIO output initial state */
#define BOARD_LPSPI1_LED_PINS_A2_GPIO_PIN                                    24U   /*!< GPIO pin number */
#define BOARD_LPSPI1_LED_PINS_A2_GPIO_PIN_MASK                       (1U << 24U)   /*!< GPIO pin mask */
#define BOARD_LPSPI1_LED_PINS_A2_PORT                                      GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_LPSPI1_LED_PINS_A2_PIN                                         24U   /*!< PORT pin number */
#define BOARD_LPSPI1_LED_PINS_A2_PIN_MASK                            (1U << 24U)   /*!< PORT pin mask */

/* GPIO_SD_B1_06 (coord L3), DisableQSPI */
/* Routed pin properties */
#define BOARD_LPSPI1_LED_PINS_FlexSPI_SS0_PERIPHERAL                       GPIO8   /*!< Peripheral name */
#define BOARD_LPSPI1_LED_PINS_FlexSPI_SS0_SIGNAL                         gpio_io   /*!< Signal name */
#define BOARD_LPSPI1_LED_PINS_FlexSPI_SS0_CHANNEL                             6U   /*!< Signal channel */

