harishankarn04/MIMXRT1064_Project_LED/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_LPSPI1_LED_PINS_FlexSPI_SS0_GPIO                             GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_LPSPI1_LED_PINS_FlexSPI_SS0_INIT_GPIO_VALUE                     1U   /*!< GPIO output initial state */
#define BOARD_LPSPI1_LED_PINS_FlexSPI_SS0_GPIO_PIN                            6U   /*!< GPIO pin number */
#define BOARD_LPSPI1_LED_PINS_FlexSPI_SS0_GPIO_PIN_MASK               (1U << 6U)   /*!< GPIO pin mask */
#define BOARD_LPSPI1_LED_PINS_FlexSPI_SS0_PORT                             GPIO8   /*!< PORT peripheral base pointer */
#define BOARD_LPSPI1_LED_PINS_FlexSPI_SS0_PIN                                 6U   /*!< PORT pin number */
#define BOARD_LPSPI1_LED_PINS_FlexSPI_SS0_PIN_MASK                    (1U << 6U)   /*!< PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void Board_LPSPI1_LED_Pins(void);

#define BOARD_GPIOBUFANDMUX_TODO_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK 0x01C00000U /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */
#define BOARD_GPIOBUFANDMUX_TODO_IOMUXC_GPR_GPR27_GPIO_MUX2_GPIO_SEL_MASK 0x81E0U /*!< GPIO2 and GPIO7 share same IO MUX function, GPIO_MUX2 selects one GPIO function: affected bits mask */

/* GPIO_B0_05 (coord B8), LCDIF_D1/BT_CFG[1] */
/* Routed pin properties */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D1_PERIPHERAL                       GPIO2   /*!< Peripheral name */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D1_SIGNAL                         gpio_io   /*!< Signal name */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D1_CHANNEL                             5U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D1_GPIO                             GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D1_GPIO_PIN                            5U   /*!< GPIO pin number */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D1_GPIO_PIN_MASK               (1U << 5U)   /*!< GPIO pin mask */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D1_PORT                             GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D1_PIN                                 5U   /*!< PORT pin number */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D1_PIN_MASK                    (1U << 5U)   /*!< PORT pin mask */

/* GPIO_B0_06 (coord A8), LCDIF_D2/BT_CFG[2] */
/* Routed pin properties */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D2_PERIPHERAL                       GPIO2   /*!< Peripheral name */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D2_SIGNAL                         gpio_io   /*!< Signal name */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D2_CHANNEL                             6U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D2_GPIO                             GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D2_GPIO_PIN                            6U   /*!< GPIO pin number */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D2_GPIO_PIN_MASK               (1U << 6U)   /*!< GPIO pin mask */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D2_PORT                             GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D2_PIN                                 6U   /*!< PORT pin number */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D2_PIN_MASK                    (1U << 6U)   /*!< PORT pin mask */

/* GPIO_B0_07 (coord A9), LCDIF_D3/BT_CFG[3] */
/* Routed pin properties */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D3_PERIPHERAL                       GPIO2   /*!< Peripheral name */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D3_SIGNAL                         gpio_io   /*!< Signal name */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D3_CHANNEL                             7U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D3_GPIO                             GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D3_GPIO_PIN                            7U   /*!< GPIO pin number */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D3_GPIO_PIN_MASK               (1U << 7U)   /*!< GPIO pin mask */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D3_PORT                             GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D3_PIN                                 7U   /*!< PORT pin number */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D3_PIN_MASK                    (1U << 7U)   /*!< PORT pin mask */

/* GPIO_B0_08 (coord B9), LCDIF_D4/BT_CFG[4] */
/* Routed pin properties */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D4_PERIPHERAL                       GPIO2   /*!< Peripheral name */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D4_SIGNAL                         gpio_io   /*!< Signal name */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D4_CHANNEL                             8U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D4_GPIO                             GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D4_GPIO_PIN                            8U   /*!< GPIO pin number */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D4_GPIO_PIN_MASK               (1U << 8U)   /*!< GPIO pin mask */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D4_PORT                             GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D4_PIN                                 8U   /*!< PORT pin number */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D4_PIN_MASK                    (1U << 8U)   /*!< PORT pin mask */

/* GPIO_AD_B1_06 (coord J12), A1 */
/* Routed pin properties */
#define BOARD_GPIOBUFANDMUX_TODO_CSI_VSYNC_PERIPHERAL                      GPIO1   /*!< Peripheral name */
#define BOARD_GPIOBUFANDMUX_TODO_CSI_VSYNC_SIGNAL                        gpio_io   /*!< Signal name */
#define BOARD_GPIOBUFANDMUX_TODO_CSI_VSYNC_CHANNEL                           22U   /*!< Signal channel */

