harishankarn04/MIMXRT1064_Project_LED/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_GPIOBUFANDMUX_TODO_CSI_VSYNC_GPIO                            GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_GPIOBUFANDMUX_TODO_CSI_VSYNC_GPIO_PIN                          22U   /*!< GPIO pin number */
#define BOARD_GPIOBUFANDMUX_TODO_CSI_VSYNC_GPIO_PIN_MASK             (1U << 22U)   /*!< GPIO pin mask */
#define BOARD_GPIOBUFANDMUX_TODO_CSI_VSYNC_PORT                            GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_GPIOBUFANDMUX_TODO_CSI_VSYNC_PIN                               22U   /*!< PORT pin number */
#define BOARD_GPIOBUFANDMUX_TODO_CSI_VSYNC_PIN_MASK                  (1U << 22U)   /*!< PORT pin mask */

/* GPIO_AD_B1_07 (coord K10), A0 */
/* Routed pin properties */
#define BOARD_GPIOBUFANDMUX_TODO_CSI_HSYNC_PERIPHERAL                      GPIO1   /*!< Peripheral name */
#define BOARD_GPIOBUFANDMUX_TODO_CSI_HSYNC_SIGNAL                        gpio_io   /*!< Signal name */
#define BOARD_GPIOBUFANDMUX_TODO_CSI_HSYNC_CHANNEL                           23U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_GPIOBUFANDMUX_TODO_CSI_HSYNC_GPIO                            GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_GPIOBUFANDMUX_TODO_CSI_HSYNC_GPIO_PIN                          23U   /*!< GPIO pin number */
#define BOARD_GPIOBUFANDMUX_TODO_CSI_HSYNC_GPIO_PIN_MASK             (1U << 23U)   /*!< GPIO pin mask */
#define BOARD_GPIOBUFANDMUX_TODO_CSI_HSYNC_PORT                            GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_GPIOBUFANDMUX_TODO_CSI_HSYNC_PIN                               23U   /*!< PORT pin number */
#define BOARD_GPIOBUFANDMUX_TODO_CSI_HSYNC_PIN_MASK                  (1U << 23U)   /*!< PORT pin mask */

/* GPIO_AD_B1_08 (coord H13), A2 */
/* Routed pin properties */
#define BOARD_GPIOBUFANDMUX_TODO_CSI_D9_PERIPHERAL                         GPIO1   /*!< Peripheral name */
#define BOARD_GPIOBUFANDMUX_TODO_CSI_D9_SIGNAL                           gpio_io   /*!< Signal name */
#define BOARD_GPIOBUFANDMUX_TODO_CSI_D9_CHANNEL                              24U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_GPIOBUFANDMUX_TODO_CSI_D9_GPIO                               GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_GPIOBUFANDMUX_TODO_CSI_D9_GPIO_PIN                             24U   /*!< GPIO pin number */
#define BOARD_GPIOBUFANDMUX_TODO_CSI_D9_GPIO_PIN_MASK                (1U << 24U)   /*!< GPIO pin mask */
#define BOARD_GPIOBUFANDMUX_TODO_CSI_D9_PORT                               GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_GPIOBUFANDMUX_TODO_CSI_D9_PIN                                  24U   /*!< PORT pin number */
#define BOARD_GPIOBUFANDMUX_TODO_CSI_D9_PIN_MASK                     (1U << 24U)   /*!< PORT pin mask */

/* GPIO_B0_15 (coord E11), LCDIF_D11/BT_CFG[11] */
/* Routed pin properties */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D11_PERIPHERAL                      GPIO2   /*!< Peripheral name */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D11_SIGNAL                        gpio_io   /*!< Signal name */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D11_CHANNEL                           15U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D11_GPIO                            GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D11_GPIO_PIN                          15U   /*!< GPIO pin number */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D11_GPIO_PIN_MASK             (1U << 15U)   /*!< GPIO pin mask */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D11_PORT                            GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D11_PIN                               15U   /*!< PORT pin number */
#define BOARD_GPIOBUFANDMUX_TODO_LCDIF_D11_PIN_MASK                  (1U << 15U)   /*!< PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 * 
 * Swamy : TODO : Init
 *
 */
void Board_GPIOBufAndMux_TODO(void);

/* GPIO_AD_B1_02 (coord L11), SPDIF_OUT/J22[7] */
/* Routed pin properties */
#define BOARD_ADC1_PINS_SPDIF_OUT_PERIPHERAL                                ADC1   /*!< Peripheral name */
#define BOARD_ADC1_PINS_SPDIF_OUT_SIGNAL                                      IN   /*!< Signal name */
#define BOARD_ADC1_PINS_SPDIF_OUT_CHANNEL                                     7U   /*!< Signal channel */

/* GPIO_AD_B1_03 (coord M12), SPDIF_IN/J22[8] */
/* Routed pin properties */
#define BOARD_ADC1_PINS_SPDIF_IN_PERIPHERAL                                 ADC1   /*!< Peripheral name */
#define BOARD_ADC1_PINS_SPDIF_IN_SIGNAL                                       IN   /*!< Signal name */
#define BOARD_ADC1_PINS_SPDIF_IN_CHANNEL                                      8U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void Board_ADC1_Pins(void);

#define HWREVISIONID_GPIO_PINS_IOMUXC_GPR_GPR27_GPIO_MUX2_GPIO_SEL_MASK 0x08U /*!< GPIO2 and GPIO7 share same IO MUX function, GPIO_MUX2 selects one GPIO function: affected bits mask */
#define HWREVISIONID_GPIO_PINS_IOMUXC_GPR_GPR28_GPIO_MUX3_GPIO_SEL_MASK 0x030007U /*!< GPIO3 and GPIO8 share same IO MUX function, GPIO_MUX3 selects one GPIO function: affected bits mask */

/* GPIO_B0_03 (coord D8), LCDIF_VSYNC/LCDIF_VSYNC/HW1/LCDIF_VSYNC/LCDIF_VSYNC/LCDIF_VSYNC/LCDIF_VSYNC */
/* Routed pin properties */
#define HWREVISIONID_GPIO_PINS_HW1_PERIPHERAL                              GPIO2   /*!< Peripheral name */
#define HWREVISIONID_GPIO_PINS_HW1_SIGNAL                                gpio_io   /*!< Signal name */
#define HWREVISIONID_GPIO_PINS_HW1_CHANNEL                                    3U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define HWREVISIONID_GPIO_PINS_HW1_GPIO                                    GPIO2   /*!< GPIO peripheral base pointer */
#define HWREVISIONID_GPIO_PINS_HW1_GPIO_PIN                                   3U   /*!< GPIO pin number */
#define HWREVISIONID_GPIO_PINS_HW1_GPIO_PIN_MASK                      (1U << 3U)   /*!< GPIO pin mask */
#define HWREVISIONID_GPIO_PINS_HW1_PORT                                    GPIO2   /*!< PORT peripheral base pointer */
#define HWREVISIONID_GPIO_PINS_HW1_PIN                                        3U   /*!< PORT pin number */
#define HWREVISIONID_GPIO_PINS_HW1_PIN_MASK                           (1U << 3U)   /*!< PORT pin mask */

/* GPIO_SD_B0_04 (coord H2), SD1_D2/SD1_D2/HW2/SD1_D2/SD1_D2/SD1_D2/SD1_D2 */
/* Routed pin properties */
#define HWREVISIONID_GPIO_PINS_HW2_PERIPHERAL                              GPIO3   /*!< Peripheral name */
#define HWREVISIONID_GPIO_PINS_HW2_SIGNAL                                gpio_io   /*!< Signal name */
#define HWREVISIONID_GPIO_PINS_HW2_CHANNEL                                   16U   /*!< Signal channel */

