harishankarn04/MIMXRT1064_Project_LED/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define HWREVISIONID_GPIO_PINS_HW2_GPIO                                    GPIO3   /*!< GPIO peripheral base pointer */
#define HWREVISIONID_GPIO_PINS_HW2_GPIO_PIN                                  16U   /*!< GPIO pin number */
#define HWREVISIONID_GPIO_PINS_HW2_GPIO_PIN_MASK                     (1U << 16U)   /*!< GPIO pin mask */
#define HWREVISIONID_GPIO_PINS_HW2_PORT                                    GPIO3   /*!< PORT peripheral base pointer */
#define HWREVISIONID_GPIO_PINS_HW2_PIN                                       16U   /*!< PORT pin number */
#define HWREVISIONID_GPIO_PINS_HW2_PIN_MASK                          (1U << 16U)   /*!< PORT pin mask */

/* GPIO_SD_B0_05 (coord J2), SD1_D3/SD1_D3/HW3/SD1_D3/SD1_D3/SD1_D3/SD1_D3 */
/* Routed pin properties */
#define HWREVISIONID_GPIO_PINS_HW3_PERIPHERAL                              GPIO3   /*!< Peripheral name */
#define HWREVISIONID_GPIO_PINS_HW3_SIGNAL                                gpio_io   /*!< Signal name */
#define HWREVISIONID_GPIO_PINS_HW3_CHANNEL                                   17U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define HWREVISIONID_GPIO_PINS_HW3_GPIO                                    GPIO3   /*!< GPIO peripheral base pointer */
#define HWREVISIONID_GPIO_PINS_HW3_GPIO_PIN                                  17U   /*!< GPIO pin number */
#define HWREVISIONID_GPIO_PINS_HW3_GPIO_PIN_MASK                     (1U << 17U)   /*!< GPIO pin mask */
#define HWREVISIONID_GPIO_PINS_HW3_PORT                                    GPIO3   /*!< PORT peripheral base pointer */
#define HWREVISIONID_GPIO_PINS_HW3_PIN                                       17U   /*!< PORT pin number */
#define HWREVISIONID_GPIO_PINS_HW3_PIN_MASK                          (1U << 17U)   /*!< PORT pin mask */

/* GPIO_SD_B1_00 (coord L5), FlexSPI_D3_B/FlexSPI_D3_B/HW4/FlexSPI_D3_B/FlexSPI_D3_B/FlexSPI_D3_B/FlexSPI_D3_B */
/* Routed pin properties */
#define HWREVISIONID_GPIO_PINS_HW4_PERIPHERAL                              GPIO3   /*!< Peripheral name */
#define HWREVISIONID_GPIO_PINS_HW4_SIGNAL                                gpio_io   /*!< Signal name */
#define HWREVISIONID_GPIO_PINS_HW4_CHANNEL                                    0U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define HWREVISIONID_GPIO_PINS_HW4_GPIO                                    GPIO3   /*!< GPIO peripheral base pointer */
#define HWREVISIONID_GPIO_PINS_HW4_GPIO_PIN                                   0U   /*!< GPIO pin number */
#define HWREVISIONID_GPIO_PINS_HW4_GPIO_PIN_MASK                      (1U << 0U)   /*!< GPIO pin mask */
#define HWREVISIONID_GPIO_PINS_HW4_PORT                                    GPIO3   /*!< PORT peripheral base pointer */
#define HWREVISIONID_GPIO_PINS_HW4_PIN                                        0U   /*!< PORT pin number */
#define HWREVISIONID_GPIO_PINS_HW4_PIN_MASK                           (1U << 0U)   /*!< PORT pin mask */

/* GPIO_SD_B1_01 (coord M5), FlexSPI_D2_B */
/* Routed pin properties */
#define HWREVISIONID_GPIO_PINS_HW5_PERIPHERAL                              GPIO3   /*!< Peripheral name */
#define HWREVISIONID_GPIO_PINS_HW5_SIGNAL                                gpio_io   /*!< Signal name */
#define HWREVISIONID_GPIO_PINS_HW5_CHANNEL                                    1U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define HWREVISIONID_GPIO_PINS_HW5_GPIO                                    GPIO3   /*!< GPIO peripheral base pointer */
#define HWREVISIONID_GPIO_PINS_HW5_GPIO_PIN                                   1U   /*!< GPIO pin number */
#define HWREVISIONID_GPIO_PINS_HW5_GPIO_PIN_MASK                      (1U << 1U)   /*!< GPIO pin mask */
#define HWREVISIONID_GPIO_PINS_HW5_PORT                                    GPIO3   /*!< PORT peripheral base pointer */
#define HWREVISIONID_GPIO_PINS_HW5_PIN                                        1U   /*!< PORT pin number */
#define HWREVISIONID_GPIO_PINS_HW5_PIN_MASK                           (1U << 1U)   /*!< PORT pin mask */

/* GPIO_SD_B1_02 (coord M3), FlexSPI_D1_B */
/* Routed pin properties */
#define HWREVISIONID_GPIO_PINS_HW6_PERIPHERAL                              GPIO3   /*!< Peripheral name */
#define HWREVISIONID_GPIO_PINS_HW6_SIGNAL                                gpio_io   /*!< Signal name */
#define HWREVISIONID_GPIO_PINS_HW6_CHANNEL                                    2U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define HWREVISIONID_GPIO_PINS_HW6_GPIO                                    GPIO3   /*!< GPIO peripheral base pointer */
#define HWREVISIONID_GPIO_PINS_HW6_GPIO_PIN                                   2U   /*!< GPIO pin number */
#define HWREVISIONID_GPIO_PINS_HW6_GPIO_PIN_MASK                      (1U << 2U)   /*!< GPIO pin mask */
#define HWREVISIONID_GPIO_PINS_HW6_PORT                                    GPIO3   /*!< PORT peripheral base pointer */
#define HWREVISIONID_GPIO_PINS_HW6_PIN                                        2U   /*!< PORT pin number */
#define HWREVISIONID_GPIO_PINS_HW6_PIN_MASK                           (1U << 2U)   /*!< PORT pin mask */

/*!
 * @brief "GPIO (9)
 * - PCB Revision (3bits)
 * - Assembly Version(3bits)
 * - Assembly Revision(3bits) "
 *
 */
void HWRevisionID_GPIO_PIns(void);

#define BOARD_INITCSI_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK 0x10U /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */

/* GPIO_AD_B1_08 (coord H13), A2 */
/* Routed pin properties */
#define BOARD_INITCSI_CSI_D9_PERIPHERAL                                      CSI   /*!< Peripheral name */
#define BOARD_INITCSI_CSI_D9_SIGNAL                                     csi_data   /*!< Signal name */
#define BOARD_INITCSI_CSI_D9_CHANNEL                                          9U   /*!< Signal channel */

/* GPIO_AD_B1_12 (coord H12), PCS0/SAI1_RXD/CSI_D5/J35[5]/U13[16]/SAI1_RXD/CSI_D5/J35[5]/U13[16] */
/* Routed pin properties */
#define BOARD_INITCSI_CSI_D5_PERIPHERAL                                      CSI   /*!< Peripheral name */
#define BOARD_INITCSI_CSI_D5_SIGNAL                                     csi_data   /*!< Signal name */
#define BOARD_INITCSI_CSI_D5_CHANNEL                                          5U   /*!< Signal channel */

